app/controllers/pages_controller.rb

  def home
    @posts = Post.all
    @newPost = Post.new
    @tofollow = User.all.first(5)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 5

  def profile

    # grab the username from the url as :id
    if(User.find_by_username(params[:id]))
      @username = params[:id]
    else
      #redirect to 404 error for now
      redirect_to root_path, :notice=> "User not found"
    end

    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
    @newPost = Post.new

    @tofollow = User.all.first(5)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "test4"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 2)  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 5
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def explore
    @posts = Post.all
    @newPost = Post.new
    @tofollow = User.all.first(5)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 5